##### Today we are learning about Pandas. So ,Basically what is pandas - pandas(all lowercase) is  a popular python based data analysis toolkitwhich can be imported using import pandas as pd. it present a diverse range of utilities , ranging  from parsing multiple file format to converting an entire data table into a numpy matrix array this makes pandas a trusted ally in data science and machine learning.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#lets create a blank series pandas

In [ ]:
ser=pd.Series()

C:\Users\safar\AppData\Local\Temp\ipykernel_13880\1876242370.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser=pd.Series()

In [ ]:
ser

Series([], dtype: float64)

In [ ]:
ser=pd.Series([0,10,20,30,40,50,60,70,80,90]) # Here You Have to Notice Data Type= Float64 :Remember:
print(ser)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [ ]:
#Notice DataType

In [ ]:
ser=pd.Series([20,15.7,'10']) # Lets check Data Type Here-Object .Why Object ? Because in data list one string is present
print(ser)

0      20
1    15.7
2      10
dtype: object

In [ ]:
#Create Dictionary

In [ ]:
dict={'A':[1,2,3],'B':[5,8,9],'C':[1,2,3]}

In [ ]:
df=pd.DataFrame(dict)
print(df)

   A  B  C
0  1  5  1
1  2  8  2
2  3  9  3

In [ ]:
#Add new Column and add values into in.

In [ ]:
df['State']="BR:CG:MP".split(':')

In [ ]:
print(df)

   A  B  C State
0  1  5  1    BR
1  2  8  2    CG
2  3  9  3    MP

In [ ]:
#How to create Nan Values and its manipulation

In [ ]:
dict={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
dict

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [ ]:
df=pd.DataFrame(dict)
print(df)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df['D']=[20,30,40]

In [ ]:
print(df)

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [ ]:
#How to Drop Nan Value from Pandas

In [ ]:
print("\n Dropping any column with nan value\n",'-'*35,sep='')
print(df.dropna(axis=1))

 Dropping any column with nan value
-----------------------------------
   C   D
0  1  20
1  2  30
2  3  40

In [ ]:
print(df) # Here Your can check there is no changes in original pandas. beacuse we can not save the data..

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [ ]:
print("\n Dropping any rows with a Nan Value\n",'-'*35)
print(df.dropna(axis=0))

 Dropping any rows with a Nan Value
 -----------------------------------
     A    B  C   D
0  1.0  5.0  1  20

In [ ]:
print(df) # Lets see here also ..its not change permanently .

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [ ]:
# Lets Fill the position of nan with 50

In [ ]:
print("\n Filling Value with a Default Value\n",'-'*35,sep='')
print(df.fillna(value=50))

 Filling Value with a Default Value
-----------------------------------
      A     B  C   D
0   1.0   5.0  1  20
1   2.0  50.0  2  30
2  50.0  50.0  3  40

In [ ]:
print(df) #Lets Check Here also its  also not changes permanently

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  30
2  NaN  NaN  3  40

In [ ]:
#DataFrame remains same will see how we can save the DataFrame later

In [ ]:
print("\n Filling Values with a computed values (mean of a column A here)\n",'-'*60,sep='')
df.fillna(value=df['C'].mean(),inplace=True)#inplace=True means we save our data for future
print(df)

 Filling Values with a computed values (mean of a column A here)
------------------------------------------------------------
     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  30
2  2.0  2.0  3  40

In [ ]:
print(df) #Lets see our data is saved

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  30
2  2.0  2.0  3  40

In [ ]:
#Creator DataFrame

In [ ]:
data={'Company':['Goog','Goog','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}

In [ ]:
df=pd.DataFrame(data)
print(df)

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
#Lets find the mean company wise. firstly we have to group by column names using groupby

In [ ]:
bycomp=df.groupby('Company')
print("\n Grouping by 'company' column and listing mean sales\n",'-'*55,sep='')
print(bycomp.mean())

 Grouping by 'company' column and listing mean sales
-------------------------------------------------------
         Sales
Company
FB       296.5
Goog     160.0
MSFT     232.0

C:\Users\safar\AppData\Local\Temp\ipykernel_13880\2525787952.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(bycomp.mean())

In [ ]:
bycomp=df.groupby('Company')
print("\n Grouping by 'Company' column and listing sum of sales\n",'-'*55,sep='')
print(bycomp.sum())

 Grouping by 'Company' column and listing sum of sales
-------------------------------------------------------
         Sales
Company
FB         593
Goog       320
MSFT       464

C:\Users\safar\AppData\Local\Temp\ipykernel_13880\2892739167.py:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  print(bycomp.sum())

In [ ]:
#Concating DataFrame
#There are Three types of concating  -1 = Concat
#                                     2  = Merge
#                                     3 =  Join

In [ ]:
class_a=pd.DataFrame({'Mat':[45,68,35,65],
                     'Eng':[54,87,36,52],
                     'Sci':[66,77,88,70],
                     'Chem':[54,79,58,76]},
                    index=['Ravi','Shyam','Saurav','Abhi'])
class_a

        Mat  Eng  Sci  Chem
Ravi     45   54   66    54
Shyam    68   87   77    79
Saurav   35   36   88    58
Abhi     65   52   70    76

In [ ]:
class_b=pd.DataFrame({'Mat':[50,87,69,71],
                     'Eng':[66,50,87,69],
                     'Sci':[34,66,69,71],
                     'Chem':[54,87,34,66]},
                    index=['Shaan','Mahi','Viru','Mona'])
class_b

       Mat  Eng  Sci  Chem
Shaan   50   66   34    54
Mahi    87   50   66    87
Viru    69   87   69    34
Mona    71   69   71    66

In [ ]:
class_c=pd.DataFrame({'Mat':[66,50,87,56],
                     'Eng':[56,87,89,71],
                     'Sci':[77,88,70,52],
                     'Chem':[34,56,56,87]},
                    index=['Astha','Rohit','Rahul','Shital'])
class_c

        Mat  Eng  Sci  Chem
Astha    66   56   77    34
Rohit    50   87   88    56
Rahul    87   89   70    56
Shital   56   71   52    87

In [ ]:
#Concatination

In [ ]:
import pandas as pd

In [ ]:
#Lets Concat row wise

In [ ]:
all_student_marks=pd.concat([class_a,class_b,class_c],axis=0)
print("\n After concatenation along row \n",'-'*30,sep='')
print(all_student_marks)

 After concatenation along row
------------------------------
        Mat  Eng  Sci  Chem
Ravi     45   54   66    54
Shyam    68   87   77    79
Saurav   35   36   88    58
Abhi     65   52   70    76
Shaan    50   66   34    54
Mahi     87   50   66    87
Viru     69   87   69    34
Mona     71   69   71    66
Astha    66   56   77    34
Rohit    50   87   88    56
Rahul    87   89   70    56
Shital   56   71   52    87

In [ ]:
#Lets Concat with Column wise

In [ ]:
df.cat2=pd.concat([class_a,class_b,class_c],axis=1)
print("\n Concat with column wise \n",'-'*60,sep='')
print(df.cat2)

 Concat with column wise
------------------------------------------------------------
         Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem
Ravi    45.0  54.0  66.0  54.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Shyam   68.0  87.0  77.0  79.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Saurav  35.0  36.0  88.0  58.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Abhi    65.0  52.0  70.0  76.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Shaan    NaN   NaN   NaN   NaN  50.0  66.0  34.0  54.0   NaN   NaN   NaN   NaN
Mahi     NaN   NaN   NaN   NaN  87.0  50.0  66.0  87.0   NaN   NaN   NaN   NaN
Viru     NaN   NaN   NaN   NaN  69.0  87.0  69.0  34.0   NaN   NaN   NaN   NaN
Mona     NaN   NaN   NaN   NaN  71.0  69.0  71.0  66.0   NaN   NaN   NaN   NaN
Astha    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  66.0  56.0  77.0  34.0
Rohit    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  50.0  87.0  88.0  56.0
Rahul    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  87.0  89.0  70.0  56.0
Shital   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  56.0  71.0  52.0  87.0

C:\Users\safar\AppData\Local\Temp\ipykernel_13880\2155776424.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.cat2=pd.concat([class_a,class_b,class_c],axis=1)

In [ ]:
#Lets Fill all Nan Zero

In [ ]:
df.cat2.fillna(value=0,inplace=True)

In [ ]:
print(df.cat2)

         Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem
Ravi    45.0  54.0  66.0  54.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0
Shyam   68.0  87.0  77.0  79.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0
Saurav  35.0  36.0  88.0  58.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0
Abhi    65.0  52.0  70.0  76.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0
Shaan    0.0   0.0   0.0   0.0  50.0  66.0  34.0  54.0   0.0   0.0   0.0   0.0
Mahi     0.0   0.0   0.0   0.0  87.0  50.0  66.0  87.0   0.0   0.0   0.0   0.0
Viru     0.0   0.0   0.0   0.0  69.0  87.0  69.0  34.0   0.0   0.0   0.0   0.0
Mona     0.0   0.0   0.0   0.0  71.0  69.0  71.0  66.0   0.0   0.0   0.0   0.0
Astha    0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  66.0  56.0  77.0  34.0
Rohit    0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  50.0  87.0  88.0  56.0
Rahul    0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  87.0  89.0  70.0  56.0
Shital   0.0   0.0   0.0   0.0   0.0   0.0   0.0   0.0  56.0  71.0  52.0  87.0

In [ ]:
#Merge

In [ ]:
player_id_name=pd.DataFrame({'ID':[25,30,35,40,45,50,55],
                            'Name':['Ronaldo','Messi','Pele','Maradona','Harry','Pogba','Chhetri']})

In [ ]:
print("Player Id and Name\n============================")
player_id_name

Player Id and Name
============================

   ID      Name
0  25   Ronaldo
1  30     Messi
2  35      Pele
3  40  Maradona
4  45     Harry
5  50     Pogba
6  55   Chhetri

In [ ]:
player_detail=pd.DataFrame({'ID':[25,30,45,50,55],
                            'Age':[36,34,20,28,37],
                            'Country':['Porugal','Argentina','England','France','India']})

In [ ]:
print("Player Details \n====================")
player_detail

Player Details
====================

   ID  Age    Country
0  25   36    Porugal
1  30   34  Argentina
2  45   20    England
3  50   28     France
4  55   37      India

In [ ]:
print("======DataSet will Merged based on the ID's==========")
pd.merge(player_id_name,player_detail,on='ID')

======DataSet will Merged based on the ID's==========

   ID     Name  Age    Country
0  25  Ronaldo   36    Porugal
1  30    Messi   34  Argentina
2  45    Harry   20    England
3  50    Pogba   28     France
4  55  Chhetri   37      India

In [ ]:
#jOin

In [ ]:
#Join Operator

In [ ]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                 index=['K0','K1','K2'])

In [ ]:
right=pd.DataFrame({'C':['C0','C2','C3'],
                   'D':['D0','D2','D3']},
                  index=['K0','K2','K3'])

In [ ]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [ ]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [ ]:
#Thats all Left Portion we learn Next Week